configuration/src/ChartsOfCharacteristicTypes/QuestionsForSurvey/QuestionsForSurvey.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>QuestionsForSurvey</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.QuestionnaireAnswersOptions</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Wording</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyType</name>
    <type>
      <types>EnumRef.TypesOfAnswersToQuestion</types>
    </type>
  </attributes>
  <attributes>
    <name>CommentRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CommentNote</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutoFill</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MinValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MaxValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accuracy</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowAggregatedValuesInReports</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RadioButtonType</name>
    <type>
      <types>EnumRef.RadioButtonTypesInQuestionnaires</types>
    </type>
  </attributes>
  <attributes>
    <name>CheckBoxType</name>
    <type>
      <types>EnumRef.CheckBoxKindsInQuestionnaires</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseMinValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseMaxValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldShowRangeSlider</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RangeSliderStep</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShouldShowHintForNumericalQuestions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>NumericalQuestionHintsRange</name>
    <attributes>
      <name>ValueUpTo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ToolTip</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Enums/TypesOfAnswersToQuestion/TypesOfAnswersToQuestion.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfAnswersToQuestion</name>
  <enumValues>
    <name>String</name>
  </enumValues>
  <enumValues>
    <name>Text</name>
  </enumValues>
  <enumValues>
    <name>Number</name>
  </enumValues>
  <enumValues>
    <name>Date</name>
  </enumValues>
  <enumValues>
    <name>Boolean</name>
  </enumValues>
  <enumValues>
    <name>InfobaseValue</name>
  </enumValues>
  <enumValues>
    <name>OneVariantOf</name>
  </enumValues>
  <enumValues>
    <name>MultipleOptionsFor</name>
  </enumValues>
</mdclass:Enum>

configuration/src/ChartsOfCharacteristicTypes/QuestionsForSurvey/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If IsFolder Then
		Return;
	EndIf;
	
	NotCheckedAttributeArray = New Array();
	
	If Not CommentRequired Then
		NotCheckedAttributeArray.Add("CommentNote");
	EndIf;
	
	If (ReplyType <> Enums.TypesOfAnswersToQuestion.String)
		And (ReplyType <> Enums.TypesOfAnswersToQuestion.Number) Then
		NotCheckedAttributeArray.Add("Length");
	EndIf;
	If ReplyType <> Enums.TypesOfAnswersToQuestion.InfobaseValue Then
		NotCheckedAttributeArray.Add("ValueType");
	EndIf;
	
	Common.DeleteNotCheckedAttributesFromArray(CheckedAttributes, NotCheckedAttributeArray);
	
EndProcedure

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	InfobaseUpdate.CheckObjectProcessed(ThisObject);
	
	If Not IsFolder Then
		ClearUnnecessaryAttributes();
		SetCCTType();
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

// The procedure clears values of unnecessary attributes.
// This situation occurs when the user changes the answer type upon editing.
//
Procedure ClearUnnecessaryAttributes()
	
	If ((ReplyType <> Enums.TypesOfAnswersToQuestion.Number) And (ReplyType <> Enums.TypesOfAnswersToQuestion.String)  And (ReplyType <> Enums.TypesOfAnswersToQuestion.Text))
	   And (Length <> 0)Then
		
		Length = 0;
		
	EndIf;
	
	If (ReplyType <> Enums.TypesOfAnswersToQuestion.Number) Then	
		
		MinValue       = 0;
		MaxValue      = 0;
		ShowAggregatedValuesInReports = False;
		ShouldShowRangeSlider = False;
		RangeSliderStep = 0;
		
	EndIf;
	
	If ReplyType = Enums.TypesOfAnswersToQuestion.MultipleOptionsFor Then
		CommentRequired = False;
		CommentNote = "";
	EndIf;
	
	If Not ShouldShowHintForNumericalQuestions Then
		NumericalQuestionHintsRange.Clear();
	EndIf;
	
EndProcedure

// Sets a CCT value type depending on the answer type.
Procedure SetCCTType()
	
	If ReplyType = Enums.TypesOfAnswersToQuestion.String Or ReplyType = Enums.TypesOfAnswersToQuestion.Text Then
		ValueType = New TypeDescription("String", , New StringQualifiers(Length));
	ElsIf ReplyType = Enums.TypesOfAnswersToQuestion.Number Then
		ValueType = New TypeDescription("Number",, New NumberQualifiers(?(Length = 0, 15, Length), Accuracy));
	ElsIf ReplyType = Enums.TypesOfAnswersToQuestion.Date Then
		ValueType = New TypeDescription("Date", New DateQualifiers(DateFractions.Date));
	ElsIf ReplyType = Enums.TypesOfAnswersToQuestion.Boolean Then
		ValueType = New TypeDescription("Boolean");
	ElsIf ReplyType = Enums.TypesOfAnswersToQuestion.OneVariantOf
		  Or ReplyType = Enums.TypesOfAnswersToQuestion.MultipleOptionsFor Then
		ValueType =  New TypeDescription("CatalogRef.QuestionnaireAnswersOptions");
	EndIf;

EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
